---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsPath3d
source: html/f1cf270a-1d9c-2b8f-3c04-198bad7c846f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsPath3d Property

Sketch is empty.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoLoopsPath3d { get; }
```